"""多个变量同时赋值"""

"""
  赋值运算符的左边可以是一个所有元素都为变量的元组或列表，从而一次给多个变量赋值。
"""

# a, b = [5, 8]
[a, b] = [5, 8]
print(a, b)  # 5 8

a, b = 5, 8
# [a, b] = 5, 8
print(a, b)  # 5 8
"""
  赋值运算符左右两个的元素个数必须是相同的，否则会抛出ValueError
"""
# a, b = 5, 8, 3  # ValueError: too many values to unpack (expected 2)
"""
    可以在赋值运算符左边的某个变量前添加*，以匹配赋值运算符右边的0个或多个元素。
"""
a, *b, c = 1, 2, 3, 4
print(a, b, c)  # 1 [2, 3] 4

a, b, *c = 1, 2, 3, 4
print(a, b, c)  # 1 2 [3, 4]

*a, b, c = 1, 2, 3, 4
print(a, b, c)  # [1, 2] 3 4

a, *b, c = 1, 2
print(a, b, c)  # 1 [] 2

"""
交换两个变量的值
a = 5
b = 8

temp = a
a = b
b = temp
print(a, b)  # 8 5
"""
a = 5
b = 8
# 赋值运算符的左右两边都是元组，左边是变量的元组，右边是表达式的元组
# 先将右边的所有表达式都计算完之后，再分别赋值给左边的所有变量
a, b = b, a
print(a, b)  # 8 5
