"""多维列表"""
"""
  当列表中的元素也是列表时，就构成了多维列表。例如：当列表中的元素是一维列表时
  就构成了二维列表；当列表中的元素是二维列表时，就构成了三维列表。因此，可以把多維列表看做是特殊的
  一维列表。
  
一、一维列表的操作也适用于多维列表
"""
L = [[3, 4], [1, 5, 2], [6, 8, 9, 7]]
print(L[2][1])  # 8

L[1] = 9
print(L)  # [[3, 4], 9, [6, 8, 9, 7]]

L.append([2, 0])
print(L)  # [[3, 4], 9, [6, 8, 9, 7], [2, 0]]
L.pop(2)
print(L)  # [[3, 4], 9, [2, 0]]

"""
二、 多维列表初始化
"""
print([[0] * 3] * 4)  # [[0, 0, 0], [0, 0, 0], [0, 0, 0], [0, 0, 0]]
print([[0 for i in range(3)] for j in range(4)])  # [[0, 0, 0], [0, 0, 0], [0, 0, 0], [0, 0, 0]]

print([[0] * 3 for j in range(4)])  # [[0, 0, 0], [0, 0, 0], [0, 0, 0], [0, 0, 0]]
